#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_role.labrole: Reading...
aws_apigatewayv2_api.tc_api_gateway: Refreshing state... [id=nke2af8wyh]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-0abda6c2aa9f452e4]
aws_vpc.tc_vpc: Refreshing state... [id=vpc-0752b1eab91432156]
aws_s3_bucket.video_upload_s3: Refreshing state... [id=videouploadtc]
aws_apigatewayv2_stage.dev: Refreshing state... [id=$default]
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
aws_subnet.public_subnet_1: Refreshing state... [id=subnet-0e73e5815ec527dea]
aws_subnet.private_subnet_1: Refreshing state... [id=subnet-05c909d645b90d63b]
aws_internet_gateway.tc_internet_gateway: Refreshing state... [id=igw-08e7c913d3dcd10d1]
aws_subnet.public_subnet_2: Refreshing state... [id=subnet-09f5344ab3e263e16]
aws_subnet.private_subnet_2: Refreshing state... [id=subnet-013bd148b01745f1f]
aws_security_group.sg_vpc_link: Refreshing state... [id=sg-012c293cf2ef2820e]
aws_security_group.eks_sg: Refreshing state... [id=sg-0db7842cc6b33976d]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0b40979480542b0ef]
aws_route_table.public_route_table: Refreshing state... [id=rtb-058dd0687996ecadd]
aws_eks_cluster.tc_eks_cluster: Refreshing state... [id=eks_vid-proc]
aws_apigatewayv2_vpc_link.tc_vpc_link: Refreshing state... [id=xa9v0d]
aws_route_table.private_route_table: Refreshing state... [id=rtb-0cb170a24f6d07f90]
aws_route_table_association.public_association_2: Refreshing state... [id=rtbassoc-00ff66b5f787450af]
aws_route_table_association.public_association_1: Refreshing state... [id=rtbassoc-04157de5cbd2fe2c7]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-0d463e1dcc41e1980]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-0383b4626d52c240c]
aws_eks_access_policy_association.tc_eks_policy: Refreshing state... [id=eks_vid-proc#arn:aws:iam::318849967381:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
aws_eks_access_entry.access-entry: Refreshing state... [id=eks_vid-proc:arn:aws:iam::318849967381:role/voclabs]
aws_eks_node_group.tc_eks_node_group: Refreshing state... [id=eks_vid-proc:ng-vid-proc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_access_entry.access-entry must be replaced
-/+ resource "aws_eks_access_entry" "access-entry" {
      ~ access_entry_arn  = "arn:aws:eks:us-east-1:660888316179:access-entry/eks_vid-proc/role/318849967381/voclabs/02cb200f-a474-0695-78b4-1b506beba888" -> (known after apply)
      ~ created_at        = "2025-04-16T19:41:54Z" -> (known after apply)
      ~ id                = "eks_vid-proc:arn:aws:iam::318849967381:role/voclabs" -> (known after apply)
      ~ modified_at       = "2025-04-16T19:41:54Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::318849967381:role/voclabs" -> "arn:aws:iam::660888316179:role/voclabs" # forces replacement
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
      ~ user_name         = "arn:aws:sts::318849967381:assumed-role/voclabs/{{SessionName}}" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_eks_access_policy_association.tc_eks_policy must be replaced
-/+ resource "aws_eks_access_policy_association" "tc_eks_policy" {
      ~ associated_at = "2025-04-16 19:41:54.48 +0000 UTC" -> (known after apply)
      ~ id            = "eks_vid-proc#arn:aws:iam::318849967381:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2025-04-16 19:41:54.48 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::318849967381:role/voclabs" -> "arn:aws:iam::660888316179:role/voclabs" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @AlexisCesar, Action: `pull_request`*